#ifndef DATAJSON_H
#define DATAJSON_H

// clothes.json 內容
const char CLOTHES_JSON[] PROGMEM = R"json([
  {
    "衣服": "褲子",
    "款式": "短褲",
    "顏色": "紅色",
    "樣式": "格紋",
    "位置": "B2",
    "UUID": "1a"
  },
  {
    "衣服": "裙子",
    "款式": "長裙",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "2b"
  },
  {
    "衣服": "褲子",
    "款式": "長褲",
    "顏色": "黃色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "3c"
  },
  {
    "衣服": "牛仔褲",
    "款式": "七分褲",
    "顏色": "綠色",
    "樣式": "直條紋",
    "位置": "A1",
    "UUID": "4w"
  },
  {
    "衣服": "上衣",
    "款式": "短袖",
    "顏色": "藍色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "5t"
  },
  {
    "衣服": "裙子",
    "款式": "皮短裙",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "ab"
  },
  {
    "衣服": "連身裙",
    "款式": "吊帶洋裝",
    "顏色": "白色",
    "樣式": "蕾絲",
    "位置": "B2",
    "UUID": "bc"
  },
  {
    "衣服": "裙子",
    "款式": "長裙",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "cd"
  },
  {
    "衣服": "上衣",
    "款式": "長袖短版",
    "顏色": "黑色",
    "樣式": "格紋",
    "位置": "B2",
    "UUID": "w"
  },
  {
    "衣服": "襯衫",
    "款式": "短袖短版",
    "顏色": "綠色",
    "樣式": "條紋",
    "位置": "A2",
    "UUID": "e"
  },
  {
    "衣服": "裙子",
    "款式": "長魚尾裙",
    "顏色": "黃色",
    "樣式": "蕾絲",
    "位置": "A1",
    "UUID": "d"
  },
  {
    "衣服": "褲子",
    "款式": "長褲",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "y"
  },
  {
    "衣服": "襯衫",
    "款式": "短袖",
    "顏色": "黃色",
    "樣式": "格紋",
    "位置": "B2",
    "UUID": "t"
  },
  {
    "衣服": "上衣",
    "款式": "短袖",
    "顏色": "灰色",
    "樣式": "直條紋",
    "位置": "A1",
    "UUID": "gg"
  },
  {
    "衣服": "毛衣",
    "款式": "長袖",
    "顏色": "藍色",
    "樣式": "有扣子",
    "位置": "B2",
    "UUID": "bb"
  },
  {
    "衣服": "牛仔褲",
    "款式": "短褲",
    "顏色": "黃色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "jj"
  },
  {
    "衣服": "褲子",
    "款式": "長喇叭褲",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "B1",
    "UUID": "nn"
  },
  {
    "衣服": "T恤",
    "款式": "短袖",
    "顏色": "藍色",
    "樣式": "直條紋",
    "位置": "A2",
    "UUID": "eee"
  },
  {
    "衣服": "褲子",
    "款式": "寬褲",
    "顏色": "紅色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "vv"
  },
  {
    "衣服": "外套",
    "款式": "風衣",
    "顏色": "紅色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "tt"
  },
  {
    "衣服": "襯衫",
    "款式": "長袖",
    "顏色": "黃色",
    "樣式": "條紋",
    "位置": "A2",
    "UUID": "2we"
  },
  {
    "衣服": "T恤",
    "款式": "長袖",
    "顏色": "藍色",
    "樣式": "蕾絲",
    "位置": "B1",
    "UUID": "cf4"
  },
  {
    "衣服": "連身裙",
    "款式": "短洋裝",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "3rd"
  },
  {
    "衣服": "外套",
    "款式": "大衣",
    "顏色": "紅色",
    "樣式": "格紋",
    "位置": "B2",
    "UUID": "r4y"
  },
  {
    "衣服": "連身裙",
    "款式": "無袖短洋裝",
    "顏色": "白色",
    "樣式": "蕾絲",
    "位置": "B2",
    "UUID": "ase"
  },
  {
    "衣服": "上衣",
    "款式": "短版短袖",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "cre"
  },
  {
    "衣服": "襯衫",
    "款式": "長袖",
    "顏色": "紅色",
    "樣式": "條紋",
    "位置": "B2",
    "UUID": "bgt"
  },
  {
    "衣服": "褲子",
    "款式": "短褲",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "hye"
  },
  {
    "衣服": "裙子",
    "款式": "短百褶裙",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "B1",
    "UUID": "23d"
  },
  {
    "衣服": "外套",
    "款式": "風衣",
    "顏色": "黑色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "caw"
  },
  {
    "衣服": "外套",
    "款式": "短版",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "zse"
  },
  {
    "衣服": "牛仔褲",
    "款式": "寬庫",
    "顏色": "紅色",
    "樣式": "花紋",
    "位置": "B2",
    "UUID": "cfe"
  },
  {
    "衣服": "襯衫",
    "款式": "長袖",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "xsw"
  },
  {
    "衣服": "連身裙",
    "款式": "長袖",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "vrs"
  },
  {
    "衣服": "上衣",
    "款式": "長袖",
    "顏色": "藍色",
    "樣式": "格紋",
    "位置": "A2",
    "UUID": "34f"
  },
  {
    "衣服": "外套",
    "款式": "短袖",
    "顏色": "紅色",
    "樣式": "格紋",
    "位置": "A1",
    "UUID": "fr5"
  },
  {
    "衣服": "毛衣",
    "款式": "毛衣",
    "顏色": "紅色",
    "樣式": "條紋",
    "位置": "B2",
    "UUID": "bgd"
  },
  {
    "衣服": "連身裙",
    "款式": "短袖",
    "顏色": "綠色",
    "樣式": "直條紋",
    "位置": "A1",
    "UUID": "htf"
  },
  {
    "衣服": "褲子",
    "款式": "長褲",
    "顏色": "紅色",
    "樣式": "條紋",
    "位置": "B2",
    "UUID": "vfs"
  },
  {
    "衣服": "襯衫",
    "款式": "長袖",
    "顏色": "藍色",
    "樣式": "格紋",
    "位置": "B2",
    "UUID": "cfr"
  },
  {
    "衣服": "毛衣",
    "款式": "短版",
    "顏色": "黑色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "bga"
  },
  {
    "衣服": "上衣",
    "款式": "長袖",
    "顏色": "綠色",
    "樣式": "條紋",
    "位置": "A2",
    "UUID": "xws"
  },
  {
    "衣服": "連身裙",
    "款式": "無袖洋裝",
    "顏色": "藍色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "ukf"
  },
  {
    "衣服": "連身裙",
    "款式": "短袖",
    "顏色": "綠色",
    "樣式": "花紋",
    "位置": "A2",
    "UUID": "34r5r"
  },
  {
    "衣服": "外套",
    "款式": "短版",
    "顏色": "黃色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "geve"
  },
  {
    "衣服": "連身裙",
    "款式": "長袖",
    "顏色": "藍色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "erv"
  },
  {
    "衣服": "牛仔褲",
    "款式": "短褲",
    "顏色": "黃色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "wervw"
  },
  {
    "衣服": "上衣",
    "款式": "短袖",
    "顏色": "藍色",
    "樣式": "條紋",
    "位置": "B2",
    "UUID": "ytjt"
  },
  {
    "衣服": "T恤",
    "款式": "短袖",
    "顏色": "白色",
    "樣式": "有扣子",
    "位置": "A1",
    "UUID": "fbr"
  },
  {
    "衣服": "裙子",
    "款式": "長裙",
    "顏色": "綠色",
    "樣式": "格紋",
    "位置": "A1",
    "UUID": "gxcb"
  },
  {
    "衣服": "褲子",
    "款式": "長褲",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "bct"
  },
  {
    "衣服": "連身裙",
    "款式": "長袖",
    "顏色": "黑色",
    "樣式": "蕾絲",
    "位置": "A2",
    "UUID": "bcg"
  },
  {
    "衣服": "外套",
    "款式": "風衣",
    "顏色": "白色",
    "樣式": "格紋",
    "位置": "A2",
    "UUID": "fbcx"
  },
  {
    "衣服": "T恤",
    "款式": "短袖",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "gr53"
  },
  {
    "衣服": "裙子",
    "款式": "長裙",
    "顏色": "白色",
    "樣式": "直條紋",
    "位置": "A2",
    "UUID": "g43ter"
  },
  {
    "衣服": "T恤",
    "款式": "短袖",
    "顏色": "白色",
    "樣式": "條紋",
    "位置": "B2",
    "UUID": "546yf"
  },
  {
    "衣服": "外套",
    "款式": "風衣",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "vd4t43"
  },
  {
    "衣服": "褲子",
    "款式": "短褲",
    "顏色": "白色",
    "樣式": "條紋",
    "位置": "A2",
    "UUID": "54yfd"
  },
  {
    "衣服": "褲子",
    "款式": "長褲",
    "顏色": "黃色",
    "樣式": "格紋",
    "位置": "A1",
    "UUID": "g343"
  },
  {
    "衣服": "牛仔褲",
    "款式": "喇叭褲",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "g45fg"
  },
  {
    "衣服": "牛仔褲",
    "款式": "七分褲",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "g43ter"
  },
  {
    "衣服": "褲子",
    "款式": "短褲",
    "顏色": "紅色",
    "樣式": "條紋",
    "位置": "A2",
    "UUID": "4554ts"
  },
  {
    "衣服": "褲子",
    "款式": "長褲",
    "顏色": "藍色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "f4r"
  },
  {
    "衣服": "褲子",
    "款式": "五分褲",
    "顏色": "白色",
    "樣式": "花紋",
    "位置": "A2",
    "UUID": "t4t5"
  },
  {
    "衣服": "T恤",
    "款式": "短袖",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "g54t"
  },
  {
    "衣服": "連身裙",
    "款式": "無袖洋裝",
    "顏色": "黑色",
    "樣式": "格紋",
    "位置": "B2",
    "UUID": "jyuj"
  },
  {
    "衣服": "裙子",
    "款式": "短裙",
    "顏色": "灰色",
    "樣式": "格紋",
    "位置": "B2",
    "UUID": "db"
  },
  {
    "衣服": "裙子",
    "款式": "短裙",
    "顏色": "藍色",
    "樣式": "素色",
    "位置": "A1",
    "UUID": "vdf"
  },
  {
    "衣服": "毛衣",
    "款式": "毛衣",
    "顏色": "黃色",
    "樣式": "條紋",
    "位置": "B2",
    "UUID": "regr"
  },
  {
    "衣服": "毛衣",
    "款式": "毛衣",
    "顏色": "灰色",
    "樣式": "花紋",
    "位置": "A1",
    "UUID": "fer4"
  },
  {
    "衣服": "褲子",
    "款式": "短褲",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "B1",
    "UUID": "5ytr"
  },
  {
    "衣服": "襯衫",
    "款式": "長袖",
    "顏色": "藍色",
    "樣式": "條紋",
    "位置": "A2",
    "UUID": "fg5"
  },
  {
    "衣服": "裙子",
    "款式": "長裙",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "B2",
    "UUID": "g5y"
  },
  {
    "衣服": "外套",
    "款式": "短版",
    "顏色": "灰色",
    "樣式": "條紋",
    "位置": "A2",
    "UUID": "gffb"
  },
  {
    "衣服": "T恤",
    "款式": "長袖",
    "顏色": "灰色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "g44"
  },
  {
    "衣服": "褲子",
    "款式": "長褲",
    "顏色": "灰色",
    "樣式": "格紋",
    "位置": "A1",
    "UUID": "vce4t"
  },
  {
    "衣服": "上衣",
    "款式": "短袖",
    "顏色": "白色",
    "樣式": "直條紋",
    "位置": "A1",
    "UUID": "5trg"
  },
  {
    "衣服": "褲子",
    "款式": "長褲",
    "顏色": "白色",
    "樣式": "素色",
    "位置": "A2",
    "UUID": "fg4"
  },
  {
    "衣服": "毛衣",
    "款式": "毛衣",
    "顏色": "灰色",
    "樣式": "格紋",
    "位置": "B2",
    "UUID": "fdcv4"
  },
  {
    "衣服": "裙子",
    "款式": "短裙",
    "顏色": "灰色",
    "樣式": "格紋",
    "位置": "A1",
    "UUID": "55tg"
  }
])json";

// history.json 內容
const char HISTORY_JSON[] PROGMEM = R"json([
  {
    "Time": "2025-02-16",
    "Wx": "陰時多雲",
    "MaxT": 0,
    "MinT": 0,
    "CI": "涼爽",
    "PoP": 73,
    "Top": "毛衣",
    "Top-color": "黃色",
    "Top-type": "素色",
    "Bottom": "長褲",
    "Bottom-color": "紅色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-03-03",
    "Wx": "晴時多雲",
    "MaxT": 2,
    "MinT": 2,
    "CI": "涼爽",
    "PoP": 74,
    "Top": "長袖",
    "Top-color": "綠色",
    "Top-type": "條紋",
    "Bottom": "長褲",
    "Bottom-color": "藍色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-03-05",
    "Wx": "晴時多雲",
    "MaxT": 2,
    "MinT": 2,
    "CI": "涼爽",
    "PoP": 13,
    "Top": "長袖",
    "Top-color": "紅色",
    "Top-type": "素色",
    "Bottom": "長褲",
    "Bottom-color": "綠色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-01-25",
    "Wx": "陰時多雲",
    "MaxT": 3,
    "MinT": 3,
    "CI": "舒適",
    "PoP": 73,
    "Top": "襯衫",
    "Top-color": "黑色",
    "Top-type": "素色",
    "Bottom": "裙子",
    "Bottom-color": "紅色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-18",
    "Wx": "陰時多雲",
    "MaxT": 3,
    "MinT": 1,
    "CI": "炎熱",
    "PoP": 68,
    "Top": "襯衫",
    "Top-color": "藍色",
    "Top-type": "條紋",
    "Bottom": "裙子",
    "Bottom-color": "黃色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-02-24",
    "Wx": "晴時多雲",
    "MaxT": 3,
    "MinT": 3,
    "CI": "涼爽",
    "PoP": 33,
    "Top": "毛衣",
    "Top-color": "紅色",
    "Top-type": "條紋",
    "Bottom": "長褲",
    "Bottom-color": "白色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-03-09",
    "Wx": "陰天",
    "MaxT": 5,
    "MinT": 1,
    "CI": "舒適",
    "PoP": 1,
    "Top": "襯衫",
    "Top-color": "綠色",
    "Top-type": "素色",
    "Bottom": "長褲",
    "Bottom-color": "黑色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-01-31",
    "Wx": "多雲時晴",
    "MaxT": 6,
    "MinT": 2,
    "CI": "涼爽",
    "PoP": 52,
    "Top": "毛衣",
    "Top-color": "綠色",
    "Top-type": "花紋",
    "Bottom": "長褲",
    "Bottom-color": "黃色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-02-14",
    "Wx": "多雲時晴",
    "MaxT": 6,
    "MinT": 5,
    "CI": "涼爽",
    "PoP": 93,
    "Top": "毛衣",
    "Top-color": "白色",
    "Top-type": "格紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "藍色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-02-19",
    "Wx": "陰天",
    "MaxT": 6,
    "MinT": 5,
    "CI": "舒適",
    "PoP": 44,
    "Top": "襯衫",
    "Top-color": "紅色",
    "Top-type": "格紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "藍色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-03-06",
    "Wx": "陰時多雲",
    "MaxT": 6,
    "MinT": 1,
    "CI": "舒適",
    "PoP": 67,
    "Top": "短袖",
    "Top-color": "黃色",
    "Top-type": "素色",
    "Bottom": "長褲",
    "Bottom-color": "紅色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-02-11",
    "Wx": "晴時多雲",
    "MaxT": 7,
    "MinT": 0,
    "CI": "舒適",
    "PoP": 87,
    "Top": "襯衫",
    "Top-color": "黃色",
    "Top-type": "格紋",
    "Bottom": "裙子",
    "Bottom-color": "藍色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-02-26",
    "Wx": "陰時多雲",
    "MaxT": 7,
    "MinT": 7,
    "CI": "寒冷",
    "PoP": 42,
    "Top": "長袖",
    "Top-color": "黑色",
    "Top-type": "條紋",
    "Bottom": "長褲",
    "Bottom-color": "黑色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-02-05",
    "Wx": "晴時多雲",
    "MaxT": 9,
    "MinT": 5,
    "CI": "寒冷",
    "PoP": 48,
    "Top": "毛衣",
    "Top-color": "綠色",
    "Top-type": "格紋",
    "Bottom": "長褲",
    "Bottom-color": "藍色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-02-23",
    "Wx": "多雲時晴",
    "MaxT": 9,
    "MinT": 4,
    "CI": "涼爽",
    "PoP": 61,
    "Top": "長袖",
    "Top-color": "藍色",
    "Top-type": "素色",
    "Bottom": "牛仔褲",
    "Bottom-color": "黑色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-03-11",
    "Wx": "晴時多雲",
    "MaxT": 9,
    "MinT": 9,
    "CI": "炎熱",
    "PoP": 45,
    "Top": "襯衫",
    "Top-color": "綠色",
    "Top-type": "素色",
    "Bottom": "短褲",
    "Bottom-color": "藍色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-01-27",
    "Wx": "陰天",
    "MaxT": 10,
    "MinT": 2,
    "CI": "炎熱",
    "PoP": 74,
    "Top": "短袖",
    "Top-color": "黑色",
    "Top-type": "花紋",
    "Bottom": "裙子",
    "Bottom-color": "黑色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-12",
    "Wx": "晴時多雲",
    "MaxT": 11,
    "MinT": 1,
    "CI": "寒冷",
    "PoP": 5,
    "Top": "毛衣",
    "Top-color": "黑色",
    "Top-type": "花紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "紅色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-25",
    "Wx": "陰天",
    "MaxT": 12,
    "MinT": 0,
    "CI": "舒適",
    "PoP": 49,
    "Top": "長袖",
    "Top-color": "黃色",
    "Top-type": "素色",
    "Bottom": "牛仔褲",
    "Bottom-color": "灰色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-03-04",
    "Wx": "晴時多雲",
    "MaxT": 12,
    "MinT": 9,
    "CI": "舒適",
    "PoP": 38,
    "Top": "短袖",
    "Top-color": "黑色",
    "Top-type": "素色",
    "Bottom": "牛仔褲",
    "Bottom-color": "黃色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-02-02",
    "Wx": "晴時多雲",
    "MaxT": 13,
    "MinT": 8,
    "CI": "舒適",
    "PoP": 0,
    "Top": "短袖",
    "Top-color": "藍色",
    "Top-type": "素色",
    "Bottom": "裙子",
    "Bottom-color": "綠色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-01",
    "Wx": "多雲時晴",
    "MaxT": 15,
    "MinT": 3,
    "CI": "寒冷",
    "PoP": 83,
    "Top": "毛衣",
    "Top-color": "藍色",
    "Top-type": "素色",
    "Bottom": "牛仔褲",
    "Bottom-color": "灰色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-03-07",
    "Wx": "陰天",
    "MaxT": 15,
    "MinT": 3,
    "CI": "炎熱",
    "PoP": 27,
    "Top": "短袖",
    "Top-color": "白色",
    "Top-type": "條紋",
    "Bottom": "短褲",
    "Bottom-color": "白色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-02-17",
    "Wx": "多雲時晴",
    "MaxT": 16,
    "MinT": 16,
    "CI": "寒冷",
    "PoP": 91,
    "Top": "長袖",
    "Top-color": "黃色",
    "Top-type": "花紋",
    "Bottom": "長褲",
    "Bottom-color": "灰色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-02-13",
    "Wx": "多雲時晴",
    "MaxT": 19,
    "MinT": 16,
    "CI": "炎熱",
    "PoP": 93,
    "Top": "短袖",
    "Top-color": "綠色",
    "Top-type": "條紋",
    "Bottom": "短褲",
    "Bottom-color": "綠色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-02-08",
    "Wx": "多雲時晴",
    "MaxT": 20,
    "MinT": 20,
    "CI": "寒冷",
    "PoP": 96,
    "Top": "毛衣",
    "Top-color": "黑色",
    "Top-type": "格紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "紅色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-01-28",
    "Wx": "陰時多雲",
    "MaxT": 21,
    "MinT": 14,
    "CI": "舒適",
    "PoP": 5,
    "Top": "襯衫",
    "Top-color": "黑色",
    "Top-type": "條紋",
    "Bottom": "長褲",
    "Bottom-color": "白色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-03-02",
    "Wx": "多雲時晴",
    "MaxT": 22,
    "MinT": 20,
    "CI": "寒冷",
    "PoP": 49,
    "Top": "長袖",
    "Top-color": "綠色",
    "Top-type": "素色",
    "Bottom": "長褲",
    "Bottom-color": "綠色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-02-22",
    "Wx": "陰天",
    "MaxT": 23,
    "MinT": 8,
    "CI": "炎熱",
    "PoP": 99,
    "Top": "短袖",
    "Top-color": "黑色",
    "Top-type": "條紋",
    "Bottom": "短褲",
    "Bottom-color": "白色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-03-10",
    "Wx": "陰天",
    "MaxT": 23,
    "MinT": 19,
    "CI": "炎熱",
    "PoP": 74,
    "Top": "短袖",
    "Top-color": "黃色",
    "Top-type": "花紋",
    "Bottom": "短褲",
    "Bottom-color": "綠色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-02-03",
    "Wx": "陰時多雲",
    "MaxT": 24,
    "MinT": 11,
    "CI": "寒冷",
    "PoP": 81,
    "Top": "毛衣",
    "Top-color": "藍色",
    "Top-type": "格紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "白色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-10",
    "Wx": "陰時多雲",
    "MaxT": 24,
    "MinT": 3,
    "CI": "涼爽",
    "PoP": 13,
    "Top": "毛衣",
    "Top-color": "黃色",
    "Top-type": "花紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "藍色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-02-21",
    "Wx": "多雲時晴",
    "MaxT": 24,
    "MinT": 7,
    "CI": "寒冷",
    "PoP": 85,
    "Top": "長袖",
    "Top-color": "紅色",
    "Top-type": "素色",
    "Bottom": "長褲",
    "Bottom-color": "藍色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-01-30",
    "Wx": "陰天",
    "MaxT": 25,
    "MinT": 1,
    "CI": "涼爽",
    "PoP": 3,
    "Top": "毛衣",
    "Top-color": "紅色",
    "Top-type": "花紋",
    "Bottom": "長褲",
    "Bottom-color": "灰色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-06",
    "Wx": "陰天",
    "MaxT": 25,
    "MinT": 4,
    "CI": "涼爽",
    "PoP": 9,
    "Top": "毛衣",
    "Top-color": "白色",
    "Top-type": "格紋",
    "Bottom": "長褲",
    "Bottom-color": "黑色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-01-29",
    "Wx": "陰天",
    "MaxT": 26,
    "MinT": 15,
    "CI": "寒冷",
    "PoP": 65,
    "Top": "長袖",
    "Top-color": "紅色",
    "Top-type": "條紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "白色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-02-09",
    "Wx": "陰時多雲",
    "MaxT": 26,
    "MinT": 18,
    "CI": "舒適",
    "PoP": 74,
    "Top": "長袖",
    "Top-color": "藍色",
    "Top-type": "格紋",
    "Bottom": "裙子",
    "Bottom-color": "灰色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-01-23",
    "Wx": "多雲時晴",
    "MaxT": 27,
    "MinT": 8,
    "CI": "涼爽",
    "PoP": 44,
    "Top": "毛衣",
    "Top-color": "白色",
    "Top-type": "格紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "藍色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-01-26",
    "Wx": "多雲時晴",
    "MaxT": 27,
    "MinT": 11,
    "CI": "涼爽",
    "PoP": 68,
    "Top": "長袖",
    "Top-color": "黃色",
    "Top-type": "花紋",
    "Bottom": "長褲",
    "Bottom-color": "灰色",
    "Bottom-type": "花紋"
  },
  {
    "Time": "2025-02-28",
    "Wx": "晴時多雲",
    "MaxT": 27,
    "MinT": 19,
    "CI": "涼爽",
    "PoP": 31,
    "Top": "長袖",
    "Top-color": "灰色",
    "Top-type": "素色",
    "Bottom": "長褲",
    "Bottom-color": "藍色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-02-27",
    "Wx": "晴時多雲",
    "MaxT": 29,
    "MinT": 12,
    "CI": "舒適",
    "PoP": 61,
    "Top": "襯衫",
    "Top-color": "藍色",
    "Top-type": "條紋",
    "Bottom": "長褲",
    "Bottom-color": "黑色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-01-24",
    "Wx": "陰天",
    "MaxT": 30,
    "MinT": 25,
    "CI": "舒適",
    "PoP": 21,
    "Top": "襯衫",
    "Top-color": "綠色",
    "Top-type": "格紋",
    "Bottom": "長褲",
    "Bottom-color": "綠色",
    "Bottom-type": "格紋"
  },
  {
    "Time": "2025-03-01",
    "Wx": "多雲時晴",
    "MaxT": 30,
    "MinT": 7,
    "CI": "寒冷",
    "PoP": 14,
    "Top": "長袖",
    "Top-color": "藍色",
    "Top-type": "格紋",
    "Bottom": "長褲",
    "Bottom-color": "紅色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-03-08",
    "Wx": "陰時多雲",
    "MaxT": 31,
    "MinT": 5,
    "CI": "舒適",
    "PoP": 31,
    "Top": "襯衫",
    "Top-color": "白色",
    "Top-type": "格紋",
    "Bottom": "牛仔褲",
    "Bottom-color": "黃色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-20",
    "Wx": "多雲時晴",
    "MaxT": 32,
    "MinT": 13,
    "CI": "炎熱",
    "PoP": 88,
    "Top": "短袖",
    "Top-color": "白色",
    "Top-type": "素色",
    "Bottom": "裙子",
    "Bottom-color": "綠色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-01-22",
    "Wx": "陰時多雲",
    "MaxT": 33,
    "MinT": 32,
    "CI": "炎熱",
    "PoP": 64,
    "Top": "襯衫",
    "Top-color": "白色",
    "Top-type": "素色",
    "Bottom": "短褲",
    "Bottom-color": "藍色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-04",
    "Wx": "陰天",
    "MaxT": 36,
    "MinT": 34,
    "CI": "涼爽",
    "PoP": 29,
    "Top": "毛衣",
    "Top-color": "白色",
    "Top-type": "格紋",
    "Bottom": "長褲",
    "Bottom-color": "紅色",
    "Bottom-type": "素色"
  },
  {
    "Time": "2025-02-15",
    "Wx": "晴時多雲",
    "MaxT": 36,
    "MinT": 21,
    "CI": "炎熱",
    "PoP": 30,
    "Top": "短袖",
    "Top-color": "黃色",
    "Top-type": "格紋",
    "Bottom": "裙子",
    "Bottom-color": "黑色",
    "Bottom-type": "條紋"
  },
  {
    "Time": "2025-02-07",
    "Wx": "多雲時晴",
    "MaxT": 37,
    "MinT": 34,
    "CI": "涼爽",
    "PoP": 16,
    "Top": "毛衣",
    "Top-color": "黑色",
    "Top-type": "素色",
    "Bottom": "長褲",
    "Bottom-color": "黃色",
    "Bottom-type": "條紋"
  }
])json";

#endif // DATAJSON_H
